//1) После загрузки начальной базы в базу разработки в Конфигураторе 
//   установить параметры Автоматизированного тестирования:
//	   Запускать как клиент тестирования, 
//	   Порт 2538 // номер порта должен совпадать с номером приложения в Тестере
//2) У пользователя Администратор снять защиту от опасных действий

// *********************************************
// Создать резервную копию рабочей базы
// *********************************************

ФайлВыгрузки = "c:\Выгрузки рабочей базы\1cv8 "+Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH-mm-ss'")+".dt";

п = Новый Структура;
п.Вставить ("База", "База 1С"); // Имя рабочей базы как она названа в списке баз стартера 1С

п.Вставить ("ФайлВыгрузки", ФайлВыгрузки);

Вызвать ( "_РаботаСКонфигурациями.ВыгрузитьБазу", п );

// *********************************************
// Создать резервную копию начальной базы
// *********************************************

ФайлВыгрузкиНБ = "c:\1c_start\1cv8 "+Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH-mm-ss'")+".dt";

п = Новый Структура;
п.Вставить ("База", "_start"); // Имя начальной базы как она названа в списке баз стартера 1С
п.Вставить ("ФайлВыгрузки", ФайлВыгрузкиНБ);

Вызвать ( "_РаботаСКонфигурациями.ВыгрузитьБазу", п );

// *********************************************
// Заменить рабочую на начальную
// *********************************************

п = Новый Структура;
п.Вставить ("База", "База 1С"); // Имя рабочей базы как она названа в списке баз стартера 1С
п.Вставить ("ФайлВыгрузки", ФайлВыгрузкиНБ);

Вызвать ( "_РаботаСКонфигурациями.ВосстановитьБазу", п );

// *********************************************
// Обновить конфигурацию из хранилища
// *********************************************

п = Новый Структура;
п.Вставить ("База", "База 1С"); // Имя рабочей базы как она названа в списке баз стартера 1С

Вызвать ("_РаботаСКонфигурациями.ОбновитьКонфигурациюИзХранилища", п);

// *********************************************
// Обновить конфигурацию базы
// *********************************************

п = Новый Структура;
п.Вставить ("База", "База 1С"); // Имя рабочей базы как она названа в списке баз стартера 1С

Вызвать ("_РаботаСКонфигурациями.ОбновитьКонфигурациюБазы", п);

// *********************************************
// Подключить рабочую конфигурацию к хранилищу
// *********************************************

п = Новый Структура;
п.Вставить ("База", "База 1С"); // Имя рабочей базы как она названа в списке баз стартера 1С

Вызвать ("_РаботаСКонфигурациями.ПодключитьКонфигурациюКХранилищу", п);


