// Выгружает рабочую базу в начальную
// Используется после добавления начальных данных в рабочую базу

// *********************************************
// Выгрузка рабочей
// *********************************************

ФайлВыгрузки = "c:\Выгрузки рабочей базы\1cv8 "+Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH-mm-ss'")+".dt";

п = Новый Структура;
п.Вставить ("База", "База 1С"); // Имя рабочей базы как она названа в списке баз стартера 1С
п.Вставить ("ФайлВыгрузки", ФайлВыгрузки);

Вызвать ( "_РаботаСКонфигурациями.ВыгрузитьБазу", п );

// *********************************************
// Выгрузка начальной
// *********************************************
ФайлВыгрузкиНБ = "c:\1c_start\1cv8 "+Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH-mm-ss'")+".dt";

п = Новый Структура;
п.Вставить ("База", "_start");
п.Вставить ("ФайлВыгрузки", ФайлВыгрузкиНБ);

Вызвать ( "_РаботаСКонфигурациями.ВыгрузитьБазу", п );

// *********************************************
// Восстановление начальной
// *********************************************
п = Новый Структура;
п.Вставить ("База", "_start");
п.Вставить ("ФайлВыгрузки", ФайлВыгрузки);

Вызвать ( "_РаботаСКонфигурациями.ВосстановитьБазу", п );

