// Выгружает базу данных в dt
// Параметры
//  База - имя базы
//  ФайлВыгрузки

п = Вызвать ("_РаботаСКонфигурациями.СоздатьКомандуЗапуска.ПараметрыКомандыЗапуска");
п.Вставить ( "База", _.База);
п.Вставить ( "КлючевойПараметр", "/DumpIB """ + _.ФайлВыгрузки + """");

команда = Вызвать ("_РаботаСКонфигурациями.СоздатьКомандуЗапуска", п );

Сообщить (команда);

ЗапуститьПриложение ( команда );

// Ожидание окончания выгрузки
ИскФайл = Новый Файл(_.ФайлВыгрузки);
Пока Не ИскФайл.Существует() Цикл
	 Пауза (1);
КонецЦикла;


