// Возвращает структуру параметров для командной строки

п = Новый Структура();
п.Вставить ( "База");
п.Вставить ( "Пользователь", "Администратор");
п.Вставить ( "Пароль", "");
п.Вставить ( "КлючевойПараметр");
п.Вставить ( "ФайлВыгрузки");
п.Вставить ( "ПользовательХранилища", "Администратор");
п.Вставить ( "ПарольХранилища", "1");
п.Вставить ( "КаталогХранилища", "c:\1c_Repo"); // Путь к хранилищу, напр. "c:\1c_Repo"
п.Вставить ( "ПутьКПлатформе", Вызвать ( "_РаботаСКонфигурациями.ПутьЗапуска1С" ));

Возврат п;