
команда = _.ПутьКПлатформе + " DESIGNER";

п = _.База;
если ( п <> undefined ) тогда
	команда = команда + " /IBName """ + п + """";
конецесли;

п = _.Пользователь;
если ( п <> undefined ) тогда
	команда = команда + " /N """ + п + """";
конецесли;

п = _.Пароль;
если ( п <> undefined ) тогда
	команда = команда + " /P """ + п + """";
конецесли;

// не показывать заставку
команда = команда + " /DisableStartupMessages ";

// ключевой параметр с путями выгрузки
команда = команда + _.КлючевойПараметр;

к = _.КаталогХранилища;
если ( к <> undefined ) тогда
	
	п = _.ПользовательХранилища;
	если ( п <> undefined ) тогда
		команда = команда + " /ConfigurationRepositoryN """ + п + """";
	конецесли;
	
	п = _.ПарольХранилища;
	если ( п <> undefined ) тогда
		команда = команда + " /ConfigurationRepositoryP """ + п + """";
	конецесли;
	
	команда = команда + " /ConfigurationRepositoryF """ + к + """";
конецесли;

Возврат Команда;
