СтандартнаяОбработка = ложь;

п = новый Структура ();
п.Вставить ( "ПутьКПлатформе" );
п.Вставить ( "Пользователь" );
п.Вставить ( "Пароль" );
п.Вставить ( "База" ); // Имя ИБ как она названа в списке баз стартера 1С
п.Вставить ( "КаталогСборки" ); // Путь к каталогу сборки
п.Вставить ( "КаталогХранилища" ); // Путь к каталогу хранилища конфигурации
п.Вставить ( "ПользовательХранилища" ); // Пользователь хранилища конфигурации
п.Вставить ( "ПарольХранилища" ); // Пароль хранилища конфигурации
п.Вставить ( "НомерВерсии" ); // Номер поставляемой версии 
п.Вставить ( "ОбновляемыеВерсии" ); // Массив версий для обновления 
п.Вставить ( "Ждать", 15 ); // Кол-во секунд ожидания запуска 1С
п.Вставить ( "Параметры" ); // Прочие параметры запуска
возврат п;
