// Производит запуск конфигуратора с параметрами для создания файлов поставки
// Параметры:
// Структура, Создать файл поставки.Параметры

// *********************************************
// Изменяемые параметры каждого файла поставки
// *********************************************

НомерВерсии = "1.4.8.404";

МассивОбновляемых = Новый Массив;
МассивОбновляемых.Добавить ( "1.4.8.403" );
МассивОбновляемых.Добавить ( "1.4.8.402" );

// *********************************************
// Постоянные параметры файлов поставки
// *********************************************
  
//команда = """c:\Program Files (x86)\1cv8\8.3.10.2168\bin\1cv8.exe"" DESIGNER";
путькплатформе = """C:\Program Files (x86)\1cv8\common\1cestart.exe"" DESIGNER";

п = Вызвать ( "Создать файл поставки.Параметры" );
п.ПутьКПлатформе = путькплатформе;
п.Пользователь = "Администратор";
//п.Пароль = "";
п.База = "База 2017"; // Имя ИБ как она названа в списке баз стартера 1С
п.КаталогСборки = "c:\1С\Поставки 2017"; // Путь к каталогу сборки
п.КаталогХранилища = "c:\Repo"; // Путь к каталогу хранилища конфигурации
п.ПользовательХранилища = "Администратор"; // Администратор хранилища конфигурации
п.ПарольХранилища = ""; // Пароль хранилища конфигурации
п.НомерВерсии = НомерВерсии; // Номер поставляемой версии 
п.ОбновляемыеВерсии = МассивОбновляемых; // Массив версий для обновления 
//п.Ждать = 15; // Кол-во секунд ожидания запуска 1С
//п.Параметры = "/Visible"; // Прочие параметры запуска
	
команда = СоздатьКомандуЗапуска ( п );

Если команда = Неопределено Тогда
	Возврат;
КонецЕсли;

Сообщить (команда);

КодВозврата = "";
ЗапуститьПриложение ( команда, , Истина, КодВозврата );

Сообщить(КодВозврата);

Функция СоздатьКомандуЗапуска ( _ )

	команда = _.ПутьКПлатформе;

	п = _.База;
	если ( п <> undefined ) тогда
		команда = команда + " /IBName """ + п + """";
	конецесли;

	п = _.Пользователь;
	если ( п <> undefined ) тогда
		команда = команда + " /N """ + п + """";
	конецесли;

	п = _.Пароль;
	если ( п <> undefined ) тогда
		команда = команда + " /P """ + п + """";
	конецесли;
	
	к = _.КаталогХранилища;
	если ( к <> undefined ) тогда
		
		п = _.ПользовательХранилища;
		если ( п <> undefined ) тогда
			команда = команда + " /ConfigurationRepositoryN """ + п + """";
		конецесли;
		
		п = _.ПарольХранилища;
		если ( п <> undefined ) тогда
			команда = команда + " /ConfigurationRepositoryP """ + п + """";
		конецесли;
		
		команда = команда + " /ConfigurationRepositoryF """ + к + """";
	конецесли;
	
	ФайлПоставки = _.КаталогСборки + "\" + _.НомерВерсии + "\1Cv8.cf";
	команда = команда + " /CreateDistributionFiles -cffile """ + ФайлПоставки + """";
	
	ФайлОбновления = ФайлПоставки + "u";
	команда = команда + " -cfufile """ + ФайлОбновления + """";

	Для Каждого Версия Из _.ОбновляемыеВерсии Цикл
		ФайлВерсии = _.КаталогСборки + "\" + Версия + "\1Cv8.cf";
		команда = команда + " -f """ + ФайлВерсии + """";
//		команда = команда + " -v """ + Версия + """"; // не работает
	КонецЦикла;
	
	п = _.Параметры;
	если ( п <> undefined ) тогда
		команда = команда + " " + п;
	конецесли;
	
	Возврат Команда;
КонецФункции



