п = новый Структура ();

// Имя или объект, где нужно осуществить переход
п.Вставить ( "Таблица" );

// Колонки, по которым нужно проводить поиск
// Ключ: Представление колонки, Значение: Искомое в колонке значение
п.Вставить ( "Поля", новый Соответствие () );

// Имеет смысл для иерархических списков.
// Если истина тогда тест будет пытаться определить вариант отображения списка
// и если он иерархический, переключит его в плоский список
п.Вставить ( "Плоский", ложь );

// Поиск строки перехода будет с начала списка или таблицы
п.Вставить ( "СНачала", истина );

возврат п;
