// Производит запуск клиента тестирования
// Параметры:
// Структура, Тестер.Запустить1С.Параметры

//команда = """c:\Program Files (x86)\1cv8\8.3.10.2168\bin\1cv8.exe"" enterprise";
команда = """C:\Program Files (x86)\1cv8\common\1cestart.exe"" enterprise";

п = _.База;
если ( п <> undefined ) тогда
	команда = команда + " /IBName """ + п + """";
конецесли;

п = _.Пользователь;
если ( п <> undefined ) тогда
	команда = команда + " /N """ + п + """";
конецесли;

п = _.Пароль;
если ( п <> undefined ) тогда
	команда = команда + " /P """ + п + """";
конецесли;

п = _.Порт;
если ( п = undefined ) тогда
	команда = команда + " /TESTCLIENT";
иначе
	команда = команда + " /TESTCLIENT -TPort" + Format ( п, "NG=0" );
конецесли;

п = _.Параметры;
если ( п <> undefined ) тогда
	команда = команда + " " + п;
конецесли;

ЗапуститьПриложение ( команда );

п = _.Ждать;
если ( п <> undefined ) тогда
	Пауза ( п );
конецесли;
