// Производит открытие всех доступных пользователю объектов в коммандном интерфейсе
// Панель навигации и панель разделов должны быть включены
// Требуется доработка

// Я доработал

Подключить ();

кэш = Новый Соответствие (); // кэш проверенных форм

Интерфейс = ГлавноеОкно.ПолучитьКомандныйИнтерфейс ();

ПанельРазделов = Интерфейс.НайтиОбъект(, "Панель разделов");

Если ПанельРазделов <> Неопределено Тогда
	Разделы = ПанельРазделов.ПолучитьПодчиненныеОбъекты();
	Для каждого Раздел из Разделы Цикл
	    Если Раздел.ТекстЗаголовка <> "Рабочий стол" Тогда
		    Меню( Раздел.ТекстЗаголовка );
	    КонецЕсли;
	    ПроверитьРаздел ( кэш, Интерфейс, Раздел.ТекстЗаголовка );
	КонецЦикла; 
КонецЕсли;

Функция ПроверитьРаздел ( Кэш, Интерфейс, Раздел)
	
	ПанельНавигации = Интерфейс.НайтиОбъект(, "Панель функций");

	Если ПанельНавигации <> Неопределено Тогда
		Команды = ПанельНавигации.ПолучитьПодчиненныеОбъекты();
		Для каждого Команда из Команды Цикл
			Если Тип(Команда) = Тип("ТестируемаяГруппаКомандногоИнтерфейса") Тогда
				Продолжить;
			КонецЕсли;	
            ЗаголовокКоманды = Раздел+" / "+Команда.ТекстЗаголовка;
			ПроверитьОткрытие ( кэш, Команда.НавигационнаяСсылка, ЗаголовокКоманды );
		КонецЦикла;
	КонецЕсли;
	
	ПанельДействий = Интерфейс.НайтиОбъект(, "Панель действий");

	Если ПанельДействий <> Неопределено Тогда
		ГруппыДействий = ПанельДействий.ПолучитьПодчиненныеОбъекты();
		Для каждого ГруппаДействий из ГруппыДействий Цикл
			Действия = ГруппаДействий.ПолучитьПодчиненныеОбъекты();
            Для каждого Действие из Действия Цикл
            	ЗаголовокКоманды = Раздел+" / "+Действие.ТекстЗаголовка;
            	ПроверитьОткрытие( кэш, Действие.НавигационнаяСсылка, ЗаголовокКоманды );
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьОткрытие( Кэш, НавигационнаяСсылка, ЗаголовокКоманды )
	
	// повторные ссылки не открываем
	Проверено = Кэш.Получить( НавигационнаяСсылка );
	Если Проверено <> Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Кэш.Вставить( НавигационнаяСсылка, НавигационнаяСсылка );

	Коммандос ( НавигационнаяСсылка );
	
	Попытка
		ПроверитьОшибки ();
	Исключение
		ошибка = ОписаниеОшибки ();
	    ЗаписатьОшибку ( "Ошибка открытия: " + ЗаголовокКоманды );
	КонецПопытки;
    
	ЗакрытьВсё (); 
	
КонецФункции
