__ = Новый Соответствие ( ); // кэш проверенных форм

ГлавноеОкноТестируемого = Приложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"));
Интерфейс =  ГлавноеОкноТестируемого.ПолучитьКомандныйИнтерфейс();		

ПанельРазделов = Интерфейс.НайтиОбъект(, "Панель разделов");

Если ПанельРазделов <> Неопределено Тогда
	Разделы = ПанельРазделов.ПолучитьПодчиненныеОбъекты();
	Для каждого Раздел из Разделы Цикл
	    Если Раздел.ТекстЗаголовка <> "Рабочий стол" Тогда
		    Меню( Раздел.ТекстЗаголовка );
	    КонецЕсли;
	    ПроверитьРаздел ( Интерфейс, Раздел.ТекстЗаголовка );
	КонецЦикла; 
КонецЕсли;

Функция ПроверитьРаздел ( Интерфейс, Раздел)
	
	ПанельНавигации = Интерфейс.НайтиОбъект(, "Панель навигации");

	Если ПанельНавигации <> Неопределено Тогда
		Команды = ПанельНавигации.ПолучитьПодчиненныеОбъекты();
		Для каждого Команда из Команды Цикл
			Если Тип(Команда) = Тип("ТестируемаяГруппаКомандногоИнтерфейса") Тогда
				Продолжить;
			КонецЕсли;	
            ЗаголовокКоманды = Раздел+" / "+Команда.ТекстЗаголовка;
			ПроверитьОткрытие ( Команда.НавигационнаяСсылка, ЗаголовокКоманды );
		КонецЦикла;
	КонецЕсли;
	
	ПанельДействий = Интерфейс.НайтиОбъект(, "Панель действий");

	Если ПанельДействий <> Неопределено Тогда
		ГруппыДействий = ПанельДействий.ПолучитьПодчиненныеОбъекты();
		Для каждого ГруппаДействий из ГруппыДействий Цикл
			Действия = ГруппаДействий.ПолучитьПодчиненныеОбъекты();
            Для каждого Действие из Действия Цикл
            	ЗаголовокКоманды = Раздел+" / "+Действие.ТекстЗаголовка;
            	ПроверитьОткрытие( Действие.НавигационнаяСсылка, ЗаголовокКоманды );
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьОткрытие( НавигационнаяСсылка, ЗаголовокКоманды )
	
	// повторные ссылки не открываем
	Проверено = __.Получить( НавигационнаяСсылка );
	Если Проверено <> Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	__.Вставить( НавигационнаяСсылка, НавигационнаяСсылка );

	Коммандос ( НавигационнаяСсылка );
	
	Попытка
		ПроверитьОшибки ();
	Исключение
		ошибка = ОписаниеОшибки ();
	    ЗаписатьОшибку ( "Ошибка открытия: " + ЗаголовокКоманды );
	КонецПопытки;
    
	ЗакрытьВсё (); 
	
КонецФункции

