Вызвать ( "Общее.Начало" );
ЗакрытьВсе ();

__.Вставить("Открыты", Новый Соответствие ( )); // кэш проверенных форм

ОкноПриложения = ГлавноеОкно;
КомандныйИнтерфейс = ОкноПриложения.ПолучитьКомандныйИнтерфейс ();

ПанельРазделов = КомандныйИнтерфейс.НайтиОбъект(, "Панель разделов");

Если ПанельРазделов = Неопределено Тогда
	Сообщить("Установите видимость Панели разделов в интерфейсе!");
	ЗаписатьОшибку ("Не установлена видимость Панели разделов в интерфейсе!");	 
Иначе
	Разделы = ПанельРазделов.ПолучитьПодчиненныеОбъекты();
	Для каждого Кнопка из Разделы Цикл
		Кнопка.Нажать();
	    ПроверитьРаздел ( КомандныйИнтерфейс, Кнопка.ТекстЗаголовка );
	КонецЦикла;
КонецЕсли;

Функция ПроверитьРаздел ( КомандныйИнтерфейс, Раздел)
	МенюФункций = КомандныйИнтерфейс.НайтиОбъект(, "Меню функций");
	Команды = МенюФункций.НайтиОбъекты();	
	Для каждого Команда из Команды Цикл
		Если Тип(Команда) = Тип("ТестируемаяГруппаКомандногоИнтерфейса") Тогда
			Продолжить;
		КонецЕсли;	
        ЗаголовокКоманды = Раздел+" / "+Команда.ТекстЗаголовка;
		ПроверитьОткрытие ( Команда.НавигационнаяСсылка, ЗаголовокКоманды );
	КонецЦикла;	
КонецФункции

Функция ПроверитьОткрытие( НавигационнаяСсылка, ЗаголовокКоманды )
	
	// повторные ссылки не открываем
	Проверено = __.Открыты.Получить( НавигационнаяСсылка );
	
	Если Проверено = Неопределено Тогда
		__.Открыты.Вставить( НавигационнаяСсылка, НавигационнаяСсылка );

		Коммандос ( НавигационнаяСсылка );
		
		Попытка
			ПроверитьОшибки ();
		Исключение
			ошибка = ОписаниеОшибки ();
		    ЗаписатьОшибку ( "Ошибка открытия: " + ЗаголовокКоманды );
		КонецПопытки;
	    
		ЗакрытьВсё (); 
	КонецЕсли;
КонецФункции

