стэк = Debug.Stack [ Debug.Level - 1 ];
если ( стэк.IsVersion
	или не захвачен ( стэк.Module ) ) тогда
	Пауза ( 1 );
	значение = Цел ( ( ТекущаяУниверсальнаяДатаВМиллисекундах () / 1000 ) % 1000000000 );
	возврат Conversion.DecToHex ( значение );
иначе
	возврат _;
конецесли;

&НаСервере
Функция захвачен ( Модуль )

	с = "
	|выбрать разрешенные первые 1 1
	|из Справочник.Scenarios как Сценарии
	|	//
	|	// Редактирование
	|	//
	|	соединение РегистрСведений.Editing as Редактирование
	|	on Редактирование.Scenario = Сценарии.Ref
	|	and Редактирование.User = &Я
	|где Сценарии.Code = &Модуль
	|";
	з = новый Запрос ( с );
	з.УстановитьПараметр ( "Модуль", Модуль );
	з.УстановитьПараметр ( "Я", ПараметрыСеанса.User );
	возврат не з.Выполнить ().Пустой ();

КонецФункции
