// Сценарий для ручного запуска тестов списком.
// Список тестов определяется пользователем через форму с флажками.
// Тестируемое приложение определяется из текущего окружения пользователя.

Подключить ();
ЗакрытьВсё ();

// Получаем все тесты
п = новый Структура ();
п.Вставить ( "Имя", ИмяПриложения );
исключения = новый Массив ();
исключения.Добавить ( "ЗапуститьERP2тесты" );
п.Вставить ( "Исключения", исключения );
тесты = Вызвать ( "Тестер.Сценарии", п );

// Предлагаем пользователю отметить сценарии для запуска
список = новый СписокЗначений ();
список.ЗагрузитьЗначения ( тесты );
список.ЗаполнитьПометки ( истина );
если ( не список.ОтметитьЭлементы () ) тогда
	возврат;
конецесли;
тесты = новый Массив ();
для каждого тест из список цикл
	если ( тест.Пометка ) тогда
		тесты.Добавить ( тест.Значение );
	конецесли;
конеццикла;
если ( тесты.Количество () = 0 ) тогда
	возврат;
конецесли;

// Запускаем выбранные тесты
для каждого сценарий из тесты цикл
	попытка
		Test.Start ( сценарий, ИмяПриложения );
		ЗакрытьВсё ();
	исключение
		Отключить ();
	конецпопытки;
конеццикла;
