// Производит запуск клиента тестирования
// Параметры:
// Структура, Тестер.Запустить1С.Параметры

команда = """C:\Program Files (x86)\1cv8\common\1cestart.exe"" enterprise /TESTCLIENT";

п = _.База;
если ( п <> undefined ) тогда
	команда = команда + " /IBName """ + п + """";
конецесли;

п = _.Пользователь;
если ( п <> undefined ) тогда
	команда = команда + " /N """ + п + """";
конецесли;

п = _.Пароль;
если ( п <> undefined ) тогда
	команда = команда + " /P """ + п + """";
конецесли;

п = _.Порт;
если ( п <> undefined ) тогда
	команда = команда + " /TPORT " + Format ( п, "NG=0" );
конецесли;

п = _.Параметры;
если ( п <> undefined ) тогда
	команда = команда + " " + п;
конецесли;

ЗапуститьПриложение ( команда );

п = _.Ждать;
если ( п <> undefined ) тогда
	Пауза ( п );
конецесли;
